app/controllers/siritoris_controller.rb

SELECT "siritoris".* FROM "siritoris" ORDER BY "siritoris"."created_at" DESC LIMIT ? OFFSET ?  [["LIMIT", 12], ["OFFSET", 0]]
SELECT COUNT(*) FROM "siritoris"
---
  def index
    @siritoris = Siritori.order(created_at: :DESC).page(params[:page]).per(12)

SELECT "siritoris".* FROM "siritoris" ORDER BY "siritoris"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
  def new
    @siritori = Siritori.new
    @siritori_last = Siritori.last

INSERT INTO "siritoris" ("word", "score", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["word", "いいね"], ["score", 0.4], ["created_at", "2020-11-07 06:25:53.928817"], ["updated_at", "2020-11-07 06:25:53.928817"]]
---
  def create
    @siritori = Siritori.new(siritori_params)

    respond_to do |format|
      if @siritori.save

DELETE FROM "siritoris" WHERE "siritoris"."id" = ?  [["id", 17]]
---
  def destroy
    @siritori.destroy

SELECT "siritoris".* FROM "siritoris" WHERE "siritoris"."id" = ? LIMIT ?  [["id", 28], ["LIMIT", 1]]
---
    def set_siritori
      @siritori = Siritori.find(params[:id])