app/models/siritori.rb


    # しりとりを成立させるバリデーション
    validate do
        errors.add(:word, 'がしりとりになっていません') if word !~ /\A[#{Siritori.last.word[-1]}][ぁ-ん]*[ぁ-を]\z/
---
SELECT "siritoris".* FROM "siritoris" ORDER BY "siritoris"."id" DESC LIMIT ?  [["LIMIT", 1]]